; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_14_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 - counter
	)
  (:init
		(= (value c0) 5)
	(= (value c1) 22)
	(= (value c2) 90)
	(= (value c3) 96)
	(= (value c4) 66)
	(= (value c5) 48)
	(= (value c6) 63)
	(= (value c7) 63)
	(= (value c8) 9)
	(= (value c9) 27)
	(= (value c10) 6)
	(= (value c11) 60)
	(= (value c12) 99)
	(= (value c13) 87)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)
	(= (rate_value c13) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
	(<= (+ (value c12) 1) (value c13))
		)
	)
)

; plan
1. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 7 of 13
2. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 7 of 13
3. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 7 of 13
4. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 7 of 13
5. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 7 of 13
6. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 7 of 13
7. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 7 of 13
8. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 7 of 13
9. (increase_rate c8)
   changed: (rate_value c8) from 5 to 6
   goals met: 7 of 13
10. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 7 of 13
11. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 7 of 13
12. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 7 of 13
13. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 7 of 13
14. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 7 of 13
15. (decrement c6)
   changed: (value c6) from 63 to 62
   goals met: 8 of 13
16. (increase_rate c13)
   changed: (rate_value c13) from 0 to 1
   goals met: 8 of 13
17. (increase_rate c13)
   changed: (rate_value c13) from 1 to 2
   goals met: 8 of 13
18. (increase_rate c12)
   changed: (rate_value c12) from 0 to 1
   goals met: 8 of 13
19. (increase_rate c12)
   changed: (rate_value c12) from 1 to 2
   goals met: 8 of 13
20. (increase_rate c13)
   changed: (rate_value c13) from 2 to 3
   goals met: 8 of 13
21. (increase_rate c13)
   changed: (rate_value c13) from 3 to 4
   goals met: 8 of 13
22. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 8 of 13
23. (increase_rate c10)
   changed: (rate_value c10) from 4 to 5
   goals met: 8 of 13
24. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 8 of 13
25. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 8 of 13
26. (increase_rate c10)
   changed: (rate_value c10) from 5 to 6
   goals met: 8 of 13
27. (increment c10)
   changed: (value c10) from 6 to 12
   goals met: 8 of 13
28. (increase_rate c10)
   changed: (rate_value c10) from 6 to 7
   goals met: 8 of 13
29. (increment c10)
   changed: (value c10) from 12 to 19
   goals met: 8 of 13
30. (increment c13)
   changed: (value c13) from 87 to 91
   goals met: 8 of 13
31. (increment c13)
   changed: (value c13) from 91 to 95
   goals met: 8 of 13
32. (increment c13)
   changed: (value c13) from 95 to 99
   goals met: 8 of 13
33. (decrement c12)
   changed: (value c12) from 99 to 97
   goals met: 9 of 13
34. (increment c10)
   changed: (value c10) from 19 to 26
   goals met: 9 of 13
35. (increment c10)
   changed: (value c10) from 26 to 33
   goals met: 10 of 13
36. (increase_rate c8)
   changed: (rate_value c8) from 6 to 7
   goals met: 10 of 13
37. (increase_rate c8)
   changed: (rate_value c8) from 7 to 8
   goals met: 10 of 13
38. (increment c8)
   changed: (value c8) from 9 to 17
   goals met: 10 of 13
39. (increment c8)
   changed: (value c8) from 17 to 25
   goals met: 10 of 13
40. (increment c8)
   changed: (value c8) from 25 to 33
   goals met: 9 of 13
41. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 9 of 13
42. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 9 of 13
43. (increase_rate c8)
   changed: (rate_value c8) from 8 to 9
   goals met: 9 of 13
44. (increment c8)
   changed: (value c8) from 33 to 42
   goals met: 9 of 13
45. (increase_rate c8)
   changed: (rate_value c8) from 9 to 10
   goals met: 9 of 13
46. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 9 of 13
47. (increment c9)
   changed: (value c9) from 27 to 30
   goals met: 9 of 13
48. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 9 of 13
49. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 9 of 13
50. (increment c5)
   changed: (value c5) from 48 to 54
   goals met: 9 of 13
51. (increase_rate c5)
   changed: (rate_value c5) from 6 to 7
   goals met: 9 of 13
52. (increment c5)
   changed: (value c5) from 54 to 61
   goals met: 9 of 13
53. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 9 of 13
54. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 9 of 13
55. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 9 of 13
56. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 9 of 13
57. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 9 of 13
58. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 9 of 13
59. (increment c4)
   changed: (value c4) from 66 to 72
   goals met: 9 of 13
60. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 9 of 13
61. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 9 of 13
62. (increase_rate c4)
   changed: (rate_value c4) from 6 to 7
   goals met: 9 of 13
63. (increment c4)
   changed: (value c4) from 72 to 79
   goals met: 9 of 13
64. (increment c5)
   changed: (value c5) from 61 to 68
   goals met: 8 of 13
65. (increase_rate c4)
   changed: (rate_value c4) from 7 to 8
   goals met: 8 of 13
66. (increase_rate c4)
   changed: (rate_value c4) from 8 to 9
   goals met: 8 of 13
67. (increase_rate c4)
   changed: (rate_value c4) from 9 to 10
   goals met: 8 of 13
68. (increment c4)
   changed: (value c4) from 79 to 89
   goals met: 8 of 13
69. (increment c4)
   changed: (value c4) from 89 to 99
   goals met: 9 of 13
70. (increase_rate c5)
   changed: (rate_value c5) from 7 to 8
   goals met: 9 of 13
71. (increase_rate c5)
   changed: (rate_value c5) from 8 to 9
   goals met: 9 of 13
72. (increase_rate c5)
   changed: (rate_value c5) from 9 to 10
   goals met: 9 of 13
73. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 9 of 13
74. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 9 of 13
75. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 9 of 13
76. (increase_rate c7)
   changed: (rate_value c7) from 5 to 6
   goals met: 9 of 13
77. (decrement c7)
   changed: (value c7) from 63 to 57
   goals met: 8 of 13
78. (increment c9)
   changed: (value c9) from 30 to 33
   goals met: 7 of 13
79. (increment c10)
   changed: (value c10) from 33 to 40
   goals met: 8 of 13
80. (increment c7)
   changed: (value c7) from 57 to 63
   goals met: 9 of 13
81. (decrement c8)
   changed: (value c8) from 42 to 32
   goals met: 10 of 13
82. (increase_rate c7)
   changed: (rate_value c7) from 6 to 7
   goals met: 10 of 13
83. (increase_rate c7)
   changed: (rate_value c7) from 7 to 8
   goals met: 10 of 13
84. (increase_rate c7)
   changed: (rate_value c7) from 8 to 9
   goals met: 10 of 13
85. (increase_rate c7)
   changed: (rate_value c7) from 9 to 10
   goals met: 10 of 13
86. (increment c5)
   changed: (value c5) from 68 to 78
   goals met: 10 of 13
87. (increment c5)
   changed: (value c5) from 78 to 88
   goals met: 10 of 13
88. (decrement_rate c6)
   changed: (rate_value c6) from 1 to 0
   goals met: 10 of 13
89. (decrement c5)
   changed: (value c5) from 88 to 78
   goals met: 10 of 13
90. (decrement c5)
   changed: (value c5) from 78 to 68
   goals met: 10 of 13
91. (increment c8)
   changed: (value c8) from 32 to 42
   goals met: 9 of 13
92. (increment c9)
   changed: (value c9) from 33 to 36
   goals met: 9 of 13
93. (increment c9)
   changed: (value c9) from 36 to 39
   goals met: 9 of 13
94. (increment c9)
   changed: (value c9) from 39 to 42
   goals met: 8 of 13
95. (increment c10)
   changed: (value c10) from 40 to 47
   goals met: 9 of 13
96. (increment c9)
   changed: (value c9) from 42 to 45
   goals met: 10 of 13
97. (decrement c7)
   changed: (value c7) from 63 to 53
   goals met: 9 of 13
98. (increment c5)
   changed: (value c5) from 68 to 78
   goals met: 9 of 13
99. (increment c5)
   changed: (value c5) from 78 to 88
   goals met: 9 of 13
100. (decrement_rate c5)
   changed: (rate_value c5) from 10 to 9
   goals met: 9 of 13
101. (decrement c5)
   changed: (value c5) from 88 to 79
   goals met: 9 of 13
102. (decrement c5)
   changed: (value c5) from 79 to 70
   goals met: 9 of 13
103. (increase_rate c5)
   changed: (rate_value c5) from 9 to 10
   goals met: 9 of 13
104. (decrement c5)
   changed: (value c5) from 70 to 60
   goals met: 10 of 13
105. (increment c8)
   changed: (value c8) from 42 to 52
   goals met: 9 of 13
106. (increment c8)
   changed: (value c8) from 52 to 62
   goals met: 10 of 13
107. (increase_rate c9)
   changed: (rate_value c9) from 3 to 4
   goals met: 10 of 13
108. (increment c9)
   changed: (value c9) from 45 to 49
   goals met: 9 of 13
109. (increment c10)
   changed: (value c10) from 47 to 54
   goals met: 10 of 13
110. (increment c9)
   changed: (value c9) from 49 to 53
   goals met: 10 of 13
111. (increment c7)
   changed: (value c7) from 53 to 63
   goals met: 10 of 13
112. (decrement c8)
   changed: (value c8) from 62 to 52
   goals met: 11 of 13
113. (increment c5)
   changed: (value c5) from 60 to 70
   goals met: 10 of 13
114. (decrement c4)
   changed: (value c4) from 99 to 89
   goals met: 9 of 13
115. (decrement c3)
   changed: (value c3) from 96 to 94
   goals met: 9 of 13
116. (decrement c3)
   changed: (value c3) from 94 to 92
   goals met: 9 of 13
117. (decrement c3)
   changed: (value c3) from 92 to 90
   goals met: 8 of 13
118. (decrement c3)
   changed: (value c3) from 90 to 88
   goals met: 9 of 13
119. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 9 of 13
120. (decrement c2)
   changed: (value c2) from 90 to 89
   goals met: 9 of 13
121. (decrement c2)
   changed: (value c2) from 89 to 88
   goals met: 9 of 13
122. (decrement c2)
   changed: (value c2) from 88 to 87
   goals met: 10 of 13
123. (decrement c5)
   changed: (value c5) from 70 to 60
   goals met: 11 of 13
124. (decrement c4)
   changed: (value c4) from 89 to 79
   goals met: 10 of 13
125. (decrement c3)
   changed: (value c3) from 88 to 86
   goals met: 9 of 13
126. (decrement c3)
   changed: (value c3) from 86 to 84
   goals met: 9 of 13
127. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 9 of 13
128. (decrement c3)
   changed: (value c3) from 84 to 81
   goals met: 9 of 13
129. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 9 of 13
130. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 9 of 13
131. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 9 of 13
132. (decrement c3)
   changed: (value c3) from 81 to 78
   goals met: 10 of 13
133. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 10 of 13
134. (decrement c2)
   changed: (value c2) from 87 to 82
   goals met: 10 of 13
135. (decrement c2)
   changed: (value c2) from 82 to 77
   goals met: 11 of 13
136. (increment c5)
   changed: (value c5) from 60 to 70
   goals met: 10 of 13
137. (decrement c4)
   changed: (value c4) from 79 to 69
   goals met: 10 of 13
138. (decrement c3)
   changed: (value c3) from 78 to 75
   goals met: 9 of 13
139. (decrement c3)
   changed: (value c3) from 75 to 72
   goals met: 9 of 13
140. (decrement c3)
   changed: (value c3) from 72 to 69
   goals met: 9 of 13
141. (increase_rate c2)
   changed: (rate_value c2) from 5 to 6
   goals met: 9 of 13
142. (decrement c3)
   changed: (value c3) from 69 to 66
   goals met: 10 of 13
143. (decrement c2)
   changed: (value c2) from 77 to 71
   goals met: 10 of 13
144. (decrement c2)
   changed: (value c2) from 71 to 65
   goals met: 11 of 13
145. (decrement c5)
   changed: (value c5) from 70 to 60
   goals met: 11 of 13
146. (decrement c4)
   changed: (value c4) from 69 to 59
   goals met: 11 of 13
147. (decrement c3)
   changed: (value c3) from 66 to 63
   goals met: 10 of 13
148. (decrement c3)
   changed: (value c3) from 63 to 60
   goals met: 10 of 13
149. (decrement c3)
   changed: (value c3) from 60 to 57
   goals met: 11 of 13
150. (decrement c2)
   changed: (value c2) from 65 to 59
   goals met: 11 of 13
151. (decrement c2)
   changed: (value c2) from 59 to 53
   goals met: 12 of 13
152. (increment c8)
   changed: (value c8) from 52 to 62
   goals met: 11 of 13
153. (increment c9)
   changed: (value c9) from 53 to 57
   goals met: 10 of 13
154. (increment c10)
   changed: (value c10) from 54 to 61
   goals met: 10 of 13
155. (increment c9)
   changed: (value c9) from 57 to 61
   goals met: 9 of 13
156. (increment c10)
   changed: (value c10) from 61 to 68
   goals met: 10 of 13
157. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 10 of 13
158. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 10 of 13
159. (increment c11)
   changed: (value c11) from 60 to 62
   goals met: 10 of 13
160. (increment c11)
   changed: (value c11) from 62 to 64
   goals met: 10 of 13
161. (increment c11)
   changed: (value c11) from 64 to 66
   goals met: 10 of 13
162. (increment c11)
   changed: (value c11) from 66 to 68
   goals met: 10 of 13
163. (increment c11)
   changed: (value c11) from 68 to 70
   goals met: 11 of 13
164. (increment c9)
   changed: (value c9) from 61 to 65
   goals met: 12 of 13
165. (increment c8)
   changed: (value c8) from 62 to 72
   goals met: 12 of 13
166. (increment c9)
   changed: (value c9) from 65 to 69
   goals met: 11 of 13
167. (increment c10)
   changed: (value c10) from 68 to 75
   goals met: 11 of 13
168. (increment c11)
   changed: (value c11) from 70 to 72
   goals met: 11 of 13
169. (increment c11)
   changed: (value c11) from 72 to 74
   goals met: 11 of 13
170. (increment c11)
   changed: (value c11) from 74 to 76
   goals met: 12 of 13
171. (increment c9)
   changed: (value c9) from 69 to 73
   goals met: 13 of 13
